ronit991/TivaPeripheralDrivers/TM4C123xx.h
//	1.3 - Exception Handlers : Register Definition

typedef struct
{
	__vo uint8_t	RESERVED00[64];															// Offset(0x40) for System exceptions
	__vo uint32_t	_GPIOA;
	__vo uint32_t	_GPIOB;
	__vo uint32_t	_GPIOC;
	__vo uint32_t	_GPIOD;
	__vo uint32_t	_GPIOE;
	__vo uint32_t	_UART0;
	__vo uint32_t	_UART1;
	__vo uint32_t	_SSI0;
	__vo uint32_t	_I2C0;
	__vo uint32_t	_PWM0_FAULT;
	__vo uint32_t	_PWM0_GENERATOR0;
	__vo uint32_t	_PWM0_GENERATOR1;
	__vo uint32_t	_PWM0_GENERATOR2;
	__vo uint32_t	_QEI0;
	__vo uint32_t	_ADC0_SEQUENCE0;
	__vo uint32_t	_ADC0_SEQUENCE1;
	__vo uint32_t	_ADC0_SEQUENCE2;
	__vo uint32_t	_ADC0_SEQUENCE3;
	__vo uint32_t	_WATCHDOG_TIMER_0_AND_1;
	__vo uint32_t	_TIMER_0A;
	__vo uint32_t	_TIMER_0B;
	__vo uint32_t	_TIMER_1A;
	__vo uint32_t	_TIMER_1B;
	__vo uint32_t	_TIMER_2A;
	__vo uint32_t	_TIMER_2B;
	__vo uint32_t	_ANALOG_COMPARATOR0;
	__vo uint32_t	_ANALOG_COMPARATOR1;
	
	__vo uint8_t	RESERVED01[4];
	
	__vo uint32_t	_SYSTEM_CONTROL;
	__vo uint32_t	_FLASH_MEM_CTRL_AND_EEPROM_CTRL;
	__vo uint32_t	_GPIOF;
	
	// There are more to be added here.
	//__vo uint32_t	_
}Exception_Handler_reg;

		/* Pointer for Register Access (Exception Handlers)	*/
#define ExceptionHandlers ( (Exception_Handler_reg*)VECTOR_TABLE_BASE_ADDR )



//	1.4 - Nested Vector Interrupt Controller (NVIC) : Register Definition

typedef struct
{
	__vo uint32_t EN[5];						__vo uint32_t RESERVED0[27];
	__vo uint32_t DIS[5];						__vo uint32_t RESERVED1[27];
	__vo uint32_t PEND[5];					__vo uint32_t RESERVED2[27];
	__vo uint32_t UNPEND[5];				__vo uint32_t RESERVED3[27];
	__vo uint32_t ACTIVE[5];				__vo uint32_t RESERVED4[59];
	__vo uint32_t PRI[35];					__vo uint32_t RESERVED5[669];
	__vo uint32_t SWTRIG;
	
}NVIC_reg;

#define Nvic ( (NVIC_reg*)NVIC_BASE_ADDR )
/****************************************************************************************************************
*		NVIC Enable Registers Bit definitions																																				*
*																																																								*
*							En 0 Reg		En 1 Reg		En 2 Reg		En 3 Reg		En 4 Reg																					*
*			Bit		 		Intr#			 Intr#			 Intr#			 Intr#			 Intr#																						*
*			0...........0..........32..........64..........96.........128																							*
*			1						1					 33					 65					 97					129																							*
*			2...........2..........34..........66..........98.........130																							*
*			3						3					 35					 67					 99					131																							*
*			4...........4..........36..........68..........100........132																							*
*			5						5					 37					 69					 101				133																							*
*			6...........6..........38..........70..........102........134																							*
*			7						7					 39					 71					 103				135																							*
*			8...........8..........40..........72..........104........136																							*
*			9						9					 41					 73					 105				137																							*
*			10..........10.........42..........74..........106........138																							*
*			11					11				 43				 	 75					 107																												*
*			12..........12.........44..........76..........108																												*
*			13					13				 45					 77					 109																												*
*			14..........14.........46..........78..........110																												*
*			15					15				 47					 79					 111																												*
*			16..........16.........48..........80..........112																												*
*			17					17				 49					 81					 113																												*
*			18..........18.........50..........82..........114																												*
*			19					19				 51					 83					 115																												*
*			20..........20.........52..........84..........116																												*
*			21					21				 53					 85					 117																												*
*			22..........22.........54..........86..........118																												*
*			23					23				 55					 87					 119																												*
*			24..........24.........56..........88..........120																												*
*			25					25				 57					 89					 121																												*
*			26..........26.........58..........90..........122																												*
*			27					27				 59					 91					 123																												*
*			28..........28.........60..........92..........124																												*
*			29					29				 61					 93					 125																												*
*			30..........30.........62..........94..........126																												*
*			31					31				 63					 95					 127																												*
****************************************************************************************************************/



/******************************************************************************************************************
*																							 			GPIO Ports																										*
*		All GPIO  ports are connected to both AHB and APB Bus ( GPIOxP => APB bus GPIOxH => AHB bus )									*
******************************************************************************************************************/

//	2.1 Base Addresses

#define GPIO_BASE																		 0x40004000U
#define GPIOAP_BASE_ADDRESS							(GPIO_BASE + 0x00000000U)
#define GPIOBP_BASE_ADDRESS							(GPIO_BASE + 0x00001000U)
#define GPIOCP_BASE_ADDRESS							(GPIO_BASE + 0x00002000U)
#define GPIODP_BASE_ADDRESS							(GPIO_BASE + 0x00003000U)
#define GPIOEP_BASE_ADDRESS							(GPIO_BASE + 0x00020000U)
#define GPIOFP_BASE_ADDRESS							(GPIO_BASE + 0x00021000U)

#define GPIOAH_BASE_ADDRESS							(GPIO_BASE + 0x00054000U)
#define GPIOBH_BASE_ADDRESS							(GPIO_BASE + 0x00055000U)
#define GPIOCH_BASE_ADDRESS							(GPIO_BASE + 0x00056000U)
#define GPIODH_BASE_ADDRESS							(GPIO_BASE + 0x00057000U)
#define GPIOEH_BASE_ADDRESS							(GPIO_BASE + 0x00058000U)
#define GPIOFH_BASE_ADDRESS							(GPIO_BASE + 0x00059000U)


//	2.2 Clock Enable and Disable Macros

#define GPIOA_PCLK_EN() ( SYSCTL->RCGCGPIO |= (1<<0) )
#define GPIOB_PCLK_EN() ( SYSCTL->RCGCGPIO |= (1<<1) )
#define GPIOC_PCLK_EN() ( SYSCTL->RCGCGPIO |= (1<<2) )
#define GPIOD_PCLK_EN() ( SYSCTL->RCGCGPIO |= (1<<3) )
#define GPIOE_PCLK_EN() ( SYSCTL->RCGCGPIO |= (1<<4) )
#define GPIOF_PCLK_EN() ( SYSCTL->RCGCGPIO |= (1<<5) )

#define GPIOA_PCLK_DIS() ( SYSCTL->RCGCGPIO &= ~(1<<0) )
#define GPIOB_PCLK_DIS() ( SYSCTL->RCGCGPIO &= ~(1<<1) )
#define GPIOC_PCLK_DIS() ( SYSCTL->RCGCGPIO &= ~(1<<2) )
#define GPIOD_PCLK_DIS() ( SYSCTL->RCGCGPIO &= ~(1<<3) )
#define GPIOE_PCLK_DIS() ( SYSCTL->RCGCGPIO &= ~(1<<4) )
#define GPIOF_PCLK_DIS() ( SYSCTL->RCGCGPIO &= ~(1<<5) )


//	2.3 Register Definition

typedef struct
{
	__vo uint32_t RESERVED0[255];
	__vo uint32_t GPIO_DATA;
	__vo uint32_t GPIO_DIR;
	__vo uint32_t GPIO_IS;
	__vo uint32_t GPIO_IBE;
	__vo uint32_t GPIO_IEV;
	__vo uint32_t GPIO_IM;
	__vo uint32_t GPIO_RIS;
	__vo uint32_t GPIO_MIS;
	__vo uint32_t GPIO_ICR;
	__vo uint32_t GPIO_AFSEL;
	__vo uint32_t RESERVED1[55];
	__vo uint32_t GPIO_DR2R;
	__vo uint32_t GPIO_DR4R;
	__vo uint32_t GPIO_DR8R;
	__vo uint32_t GPIO_ODR;
	__vo uint32_t GPIO_PUR;
	__vo uint32_t GPIO_PDR;
	__vo uint32_t GPIO_SLR;
	__vo uint32_t GPIO_DEN;
	__vo uint32_t GPIO_LOCK;
	__vo uint32_t GPIO_CR;
	__vo uint32_t GPIO_AMSEL;
	__vo uint32_t GPIO_PCTL;
	__vo uint32_t GPIO_ADCCTL;
	__vo uint32_t GPIO_DMACTL;
	
