ronit991/TivaPeripheralDrivers/TM4C123xx.h
	__vo uint32_t RESERVED2[678];
	
	/*	Registers defined below are READ_ONLY.*/
	__vo uint32_t GPIOPeriphlD4;
	__vo uint32_t GPIOPeriphlD5;
	__vo uint32_t GPIOPeriphlD6;
	__vo uint32_t GPIOPeriphlD7;
	__vo uint32_t GPIOPeriphlD0;
	__vo uint32_t GPIOPeriphlD1;
	__vo uint32_t GPIOPeriphlD2;
	__vo uint32_t GPIOPeriphlD3;
	__vo uint32_t GPIOPCellID0;
	__vo uint32_t GPIOPCellID1;
	__vo uint32_t GPIOPCellID2;
	__vo uint32_t GPIOPCellID3;
}GPIO_reg;


//	2.4 Module Access Pointers

#define GPIO_A_H 		( (GPIO_reg*) GPIOAH_BASE_ADDRESS )				//	Pointers for GPIO Module on AHB Bus
#define GPIO_B_H 		( (GPIO_reg*) GPIOBH_BASE_ADDRESS )
#define GPIO_C_H 		( (GPIO_reg*) GPIOCH_BASE_ADDRESS )
#define GPIO_D_H 		( (GPIO_reg*) GPIODH_BASE_ADDRESS )
#define GPIO_E_H 		( (GPIO_reg*) GPIOEH_BASE_ADDRESS )
#define GPIO_F_H 		( (GPIO_reg*) GPIOFH_BASE_ADDRESS )

#define GPIO_A_P 		( (GPIO_reg*) GPIOAP_BASE_ADDRESS )				//	Pointers for GPIO Module on APB Bus
#define GPIO_B_P 		( (GPIO_reg*) GPIOBP_BASE_ADDRESS )
#define GPIO_C_P 		( (GPIO_reg*) GPIOCP_BASE_ADDRESS )
#define GPIO_D_P 		( (GPIO_reg*) GPIODP_BASE_ADDRESS )
#define GPIO_E_P 		( (GPIO_reg*) GPIOEP_BASE_ADDRESS )
#define GPIO_F_P 		( (GPIO_reg*) GPIOFP_BASE_ADDRESS )



/******************************************************************************************************************
*																										SSI MODULES																										*
******************************************************************************************************************/

//	3.1 Base Addresses
#define SSI0_BASE_ADDRESS			0x40008000U
#define SSI1_BASE_ADDRESS			0x40009000U
#define SSI2_BASE_ADDRESS			0x4000A000U
#define SSI3_BASE_ADDRESS			0x4000B000U


//	3.2 Clock Enable and Disable Macros
#define SSI0_PCLK_EN() 		(SYSCTL->RCGCSSI |= (1<<0)	)
#define SSI1_PCLK_EN() 		(SYSCTL->RCGCSSI |= (1<<1)	)
#define SSI2_PCLK_EN() 		(SYSCTL->RCGCSSI |= (1<<2)	)
#define SSI3_PCLK_EN() 		(SYSCTL->RCGCSSI |= (1<<3)	)

#define SSI0_PCLK_DIS() 	(SYSCTL->RCGCSSI &= ~(1<<0)	)
#define SSI1_PCLK_DIS() 	(SYSCTL->RCGCSSI &= ~(1<<1)	)
#define SSI2_PCLK_DIS() 	(SYSCTL->RCGCSSI &= ~(1<<2)	)
#define SSI3_PCLK_DIS() 	(SYSCTL->RCGCSSI &= ~(1<<3)	)


//	3.3 Register Definition
typedef struct
{
	__vo uint32_t	SSI_CR[2];								// Control Registers 0, and 1
	__vo uint32_t	SSI_DR;										// Data Register
	__vo uint32_t	SSI_SR;										// Status Register
	__vo uint32_t	SSI_CPSR;									// Clock Prescalar
	__vo uint32_t	SSI_IM;										// Interrupt Mask
	__vo uint32_t	SSI_RIS;									// Raw Interrupt Status
	__vo uint32_t	SSI_MIS;									// Masked Interrupt Status
	__vo uint32_t	SSI_ICR;									// Interrupt Clear
	__vo uint32_t	SSI_DMACTL;								// DMA Control
	
	__vo uint8_t	Reserved[4000];
	
	__vo uint32_t	SSI_CC;										// Clock Configuration
	
	__vo uint32_t	SSI_PeriphID4;
	__vo uint32_t	SSI_PeriphID5;
	__vo uint32_t	SSI_PeriphID6;
	__vo uint32_t	SSI_PeriphID7;
	__vo uint32_t	SSI_PeriphID0;
	__vo uint32_t	SSI_PeriphID1;
	__vo uint32_t	SSI_PeriphID2;
	__vo uint32_t	SSI_PeriphID3;
	__vo uint32_t	SSI_CellID[4];
	
}ssi_reg;


//	3.4 Module Access Pointers

#define pSSI0 		( (ssi_reg*) SSI0_BASE_ADDRESS )
#define pSSI1 		( (ssi_reg*) SSI1_BASE_ADDRESS )
#define pSSI2 		( (ssi_reg*) SSI2_BASE_ADDRESS )
#define pSSI3 		( (ssi_reg*) SSI3_BASE_ADDRESS )



/******************************************************************************************************************
*																										I2C MODULES																										*
******************************************************************************************************************/

//	4.1 Base Addresses

#define I2C0_BASE_ADDRESS			0x40020000U
#define I2C1_BASE_ADDRESS			0x40021000U
#define I2C2_BASE_ADDRESS			0x40022000U
#define I2C3_BASE_ADDRESS			0x40023000U


//	4.2 Clock Enable and Disable Macros

#define I2C0_PCLK_EN()			( SYSCTL->RCGCI2C |= (1<<0) )
#define I2C1_PCLK_EN()			( SYSCTL->RCGCI2C |= (1<<1) )
#define I2C2_PCLK_EN()			( SYSCTL->RCGCI2C |= (1<<2) )
#define I2C3_PCLK_EN()			( SYSCTL->RCGCI2C |= (1<<3) )

#define I2C0_PCLK_DIS()			( SYSCTL->RCGCI2C &= ~(1<<0) )
#define I2C1_PCLK_DIS()			( SYSCTL->RCGCI2C &= ~(1<<1) )
#define I2C2_PCLK_DIS()			( SYSCTL->RCGCI2C &= ~(1<<2) )
#define I2C3_PCLK_DIS()			( SYSCTL->RCGCI2C &= ~(1<<3) )


//	4.3 Register Definition

typedef struct
{
	/* I2C Master*/
	__vo uint32_t MSA;								// Master Slave Address
	__vo uint32_t MCS;								// Master Control/Status
	__vo uint32_t MDR;								// Master Data
	__vo uint32_t MTPR;								// Master Timer Period
	__vo uint32_t MIMR;								// Master Interrupt Mask
	__vo uint32_t MRIS;								// Master Raw Interrupt Status
	__vo uint32_t MMIS;								// Master Masked Interrupt Status
	__vo uint32_t MICR;								// Master Interrupt Clear
	__vo uint32_t MCR;								// Master Configuration
	__vo uint32_t MCLKOCNT;						// Master Clock Low Timeout Count
	__vo uint32_t MBMON;							// Master Bus Monitor
	__vo uint8_t	RESERVED0[8];
	__vo uint32_t MCR2;								// Master Configuration 2
	
	__vo uint8_t	RESERVED1[1988];
	
	/* I2C Slave*/
	__vo uint32_t SOAR;								// Slave Own Address
	__vo uint32_t SCSR;								// Slave Control/Status
	__vo uint32_t SDR;								// Slave Data
	__vo uint32_t SIMR;								// Slave Interrupt Mask
	__vo uint32_t SRIS;								// Slave Raw Interrupt Status
	__vo uint32_t SMIS;								// Slave Masked Interrupt Status
	__vo uint32_t SICR;								// Slave Interrupt Clear
	__vo uint32_t SOAR2;							// Slave Own Address 2
	__vo uint32_t SACKCTL;						// Slave ACK Control
	
	__vo uint8_t	RESERVED2[1948];
	
	/* I2C Control and Status*/
	__vo uint32_t PP;									// Peripheral Properties
	__vo uint32_t PC;									// Peripheral Configuration
	
}I2C_reg;


//	4.4 Module Access Pointers
#define pI2C0					( (I2C_reg*) I2C0_BASE_ADDRESS )
#define pI2C1					( (I2C_reg*) I2C1_BASE_ADDRESS )
#define pI2C2					( (I2C_reg*) I2C2_BASE_ADDRESS )
#define pI2C3					( (I2C_reg*) I2C3_BASE_ADDRESS )



/******************************************************************************************************************
*																				Miscellaneous macros and shorthands																				*
******************************************************************************************************************/
#define SYS_CLK			16000000					//	System Clock Frequency (in Hz)

#define ENABLE			1
#define DISABLE			0
#define SET					ENABLE
#define RESET				DISABLE
#define PIN_SET			SET
#define PIN_RESET		RESET
#define YES					1
#define NO					0
#define IN					0
#define OUT					1

#define APB_BUS	0
#define AHB_BUS	1

#define SET_BIT(x) |= 1<<x
#define CLR_BIT(X) &= ~ (1<<X)
#define GET_BIT(reg,bit) ( ( reg & (1 << bit) )?1:0 )



/******************************************************************************************************************
*																					Driver and other Dependencies																						*
*																																																									*
******************************************************************************************************************/
#include "TM4C123xxGPIO_DRIVER.h"
#include "TM4C123xxSSI_DRIVER.h"
#include "TM4C123xxI2C_DRIVER.h"

#include "GPIO_PINS.h"


#endif
